export async function GET() {
  return Response.json({
    sections: {

      history: {
        id: 1,
        title: "ประวัติความเป็นมา",
        content: "ก่อตั้งเมื่อวันที่ 16 ตุลาคม พ.ศ.2567 ถือหุ้นโดย บริษัท คักดิ์สยามลิสซิ่ง จํากัด (มหาชน) 100 % จํานวน 30 ล้านบาท มีวัตถุประสงค์เป็นผู้จําหน่าย และให้บริการ ติดตั้ง Solar Cell ที่มีคุณภาพอย่างครบวงจร ภายใต้ มาตรฐานคน มาตรฐานงาน และ มาตรฐานอุปกรณ์ โดย มีผลิตภัณฑ์ที่หลากหลาย เพื่อตอบสนองความต้องการของลูกค้า ภายใต้การเชื่อมโยงให้บริการสินเชื่อของศักดิ์ สยามลิสซิ่ง เป็นการตอบโจทย์ความต้องการลูกค้าและเพื่อให้ประชาชนทั่วไปเข้าถึงพลังงานสะอาด",
        image: [
          "/about/company/SAKsiam.jpg",
          "/about/company/SAKSolar.jpg"
        ]
      },

      vision: {
        id: 2,
        title: "วิสัยทัศน์",
        content: "เป็นผู้จําหน่าย และให้บริการติดตั้ง Solar Cell ที่มีคุณภาพอย่างครบวงจร ภายใต้มาตรฐานคน มาตรฐานงาน และมาตรฐานอุปกรณ์ เพื่อ ให้ประชาชนทั่วไปเข้าถึงพลังงานสะอาด อย่างมั่นคงและยั่งยืน",
        image: "/about/vision.jpg",
      },

      mission: {
        id: 3,
        title: "พันธกิจ",
        content:
          "1. จําหน่ายและติดตั้ง Solar Cell ที่มีคุณภาพอย่างครบวงจร ภายใต้มาตรฐานคน มาตรฐานงาน และมาตรฐานอุปกรณ์\n" +
          "2. ส่งเสริมประชาชนทุกอาชีพ และทุกหน่วยงานให้เลือกใช้พลังงานสะอาด\n" +
          "3. สร้างพันธมิตรทางธุรกิจ เพื่อลดต้นทุน และควบคุมคุณภาพด้านราคา\n" +
          "4. ดําเนินธุรกิจภายใต้บรรษัทภิบาล และรับผิดชอบ โดยคํานึงถึงผลกระทบต่อสังคม และสิ่งแวดล้อม\n" +
          "5. สร้างคุณภาพชีวิตที่ดีให้กับผู้มีส่วนได้เสีย\n" +
          "6. สร้างกระบวนการขั้นตอนการปฏิบัติงานที่ปลอดภัยได้มาตรฐานเพื่อป้องกันอุบัติเหตุที่เกิดขึ้นในอนาคต", image: "",
        image: "/about/mission.jpg",

      },
      committee: {
        id: 4,
        title: "คณะกรรมการ",
        members: [
          {
            name: "คุณศิวพงศ์ บุญสาลี",
            position: "คณะกรรมการ",
            photo: "/about/Committee/Committee1.jpg"
          },
          {
            name: "คุณศันศนีย์ บุญสาลี",
            position: "คณะกรรมการ",
            photo: "/about/Committee/Committee2.jpg"
          },
          {
            name: "คุณสมบูรณ์ ศุภศิริภิญโญ",
            position: "คณะกรรมการ",
            photo: "/about/Committee/Committee3.jpg"
          },
          {
            name: "คุณเรณู วิลาศรี",
            position: "คณะกรรมการ",
            photo: "/about/Committee/Committee4.jpg"
          },
          {
            name: "คุณสายันต์  กลัดเจริญ",
            position: "คณะกรรมการ",
            photo: "/about/Committee/CommitteeMen.jpg"
          },
          {
            name: "คุณวีระศักดิ์  จินดาประทุม",
            position: "คณะกรรมการ",
            photo: "/about/Committee/CommitteeMen.jpg"
          }

        ]
      }
    },
  });
}
